In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('aug_train.csv')

In [3]:
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

### opening csv file from url

In [8]:
import requests
from io import StringIO

url = "https://raw.githubusercontent.com/cs109/2014/master/countries.csv"
headers = {"User-Agent" : "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url, headers=headers)
data = StringIO(req.text)

pd.read_csv(data)

Empty DataFrame
Columns: [404: Not Found]
Index: []

### Sep parameter to read tsv files

In [ ]:
pd.read_csv("link to be pasted here", sep='\t')

In [ ]:
# if in the above the column names are missing then write the below code
pd.read_csv("link to be pasted here", sep='\t', names=['sno','year'...etc])

### index_col parameter to set a col as index

In [ ]:
pd.read_csv('aug_train.csv', index_col='enrollee_id')

### header parameter

In [ ]:
# to make the 1st row as the column name
pd.read_csv('', header=1)

### usecols parameter

In [ ]:
# while importing dataset mention the col names you want to extract
pd.read_csv('', usecols=['column name(s)...'])

### squeeze column

In [ ]:
# when only 1 column is required : converts to series
pd.read_csv('', usercols=[], squeeze=True)

### skiprows/nrows parameter

In [ ]:
# to remove / skip particular rows can be done using a function also
pd.read_csv('',skiprows=[0,4])           # skip row number 1 and 5
pd.read_csv('',nrows=100)        # now only 100 rows will be there from the dataset

### Encoding parameter

In [ ]:
# whenever while loading we have UnicodeDecodeError use this parameter
pd.read_csv('file_name',encoding='here the format/type of the file is needed to be given')

### skip bad lines

In [ ]:
# when we have ParserError we remove /skip bad line : no of cols more than expected (8 given 9)
pd.read_csv('file_name', sep=';',encoding='latin-1', error_bad_lines=False)
# all the lines having the bad data will be removed from the whole data

### dtypes parameter

In [ ]:
pd.read_csv('file_name',dtype={'target':int})

### handling dates

In [ ]:
# parse_dates makes the column as date time format 
pd.read_csv('file_name',parse_dates=['column names to convert to date format'])

### convertors

In [ ]:
# write a function for the conversion purpose
pd.read_csv('file_name',converters={'team1':rename})

### na_values parameter

In [ ]:
# it treat (changes) the value in the list as nan/null values
pd.read_csv('file_name',na_values=['-','na'])    # whenever in a dataset we have na or - replace with NaN

### loading a huge dataset in chunks

In [ ]:
dfs = pd.read_csv('file_name',chunksize=5000)

In [ ]:
for chunks in dfs:
    print(chunks.shape)

# making chunks reduces efforts to great extent